<a href="https://colab.research.google.com/github/thasliya0404/class-activity/blob/main/Untitled9.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

##**python activity**

In [4]:
#1. Create a NumPy array with values from 10 to 49 (inclusive).
#● Reshape it into a 4x10 matrix.
#● Then extract the last column from the reshaped matrix
import numpy as np
x=np.arange(10,50)
print(x)
y=x.reshape(4,10)
print(y)
last_column=y[:,-1]
print(last_column)

[10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30 31 32 33
 34 35 36 37 38 39 40 41 42 43 44 45 46 47 48 49]
[[10 11 12 13 14 15 16 17 18 19]
 [20 21 22 23 24 25 26 27 28 29]
 [30 31 32 33 34 35 36 37 38 39]
 [40 41 42 43 44 45 46 47 48 49]]
[19 29 39 49]

In [ ]:
#2. Create two 3×3 matrices:
#One filled with all 5s , One with values from 1 to 9
#● Add the two matrices
#● Multiply them element-wise
#● Then find the transpose of the result

In [8]:
mat1=np.ones((3,3))
mat2=np.arange(1,10).reshape(3,3)
add=mat1+mat2
multiplication=mat1*mat2
transpose=multiplication.T
print(mat1)
print(mat2)
print(add)
print(multiplication)
print(transpose)

[[1. 1. 1.]
 [1. 1. 1.]
 [1. 1. 1.]]
[[1 2 3]
 [4 5 6]
 [7 8 9]]
[[ 2.  3.  4.]
 [ 5.  6.  7.]
 [ 8.  9. 10.]]
[[1. 2. 3.]
 [4. 5. 6.]
 [7. 8. 9.]]
[[1. 4. 7.]
 [2. 5. 8.]
 [3. 6. 9.]]

In [10]:
#3. Create a NumPy array of 15 random integers between 10 and 100.
#● Replace all values greater than 50 with -1
#● Count how many values were replaced.
z=np.random.randint(10,101,15)
replaced=z>50
z[replaced]=-1
count_replaced=np.sum(replaced)
print(z)
print(replaced)
print(count_replaced)

[-1 -1 -1 41 48 -1 -1 16 27 45 -1 43 47 25 41]
[ True  True  True False False  True  True False False False  True False
 False False False]
6

In [13]:
#4. Generate a 5×4 array with random values between 0 and 1 (float).
#● Find the row with the maximum sum of values.
#● Normalize each row using the formula:x_norm=x-min/max-min
arr1=np.random.rand(5,4)
row_max_sum=np.argmax(arr1.sum(axis=1))
row_min=arr1.min(axis=1,keepdims=True)
row_max=arr1.max(axis=1,keepdims=True)
normalized=(arr1-row_min)/(row_max-row_min)
print(arr1)
print(row_max_sum)
print(row_max)
print(row_min)
print(normalized)

[[0.77275312 0.21330339 0.59882681 0.3210624 ]
 [0.30841745 0.36500835 0.83032613 0.55268872]
 [0.10603647 0.17277979 0.43851974 0.75722342]
 [0.63374445 0.47354377 0.49673613 0.61390103]
 [0.65299921 0.61491732 0.96039216 0.32850608]]
4
[[0.77275312]
 [0.83032613]
 [0.75722342]
 [0.63374445]
 [0.96039216]]
[[0.21330339]
 [0.30841745]
 [0.10603647]
 [0.47354377]
 [0.32850608]]
[[1.         0.         0.68911182 0.19261607]
 [0.         0.10843066 1.         0.4680345 ]
 [0.         0.10249487 0.51058037 1.        ]
 [1.         0.         0.14477072 0.87613399]
 [0.51353106 0.45326404 1.         0.        ]]

In [18]:
#5. arr = np.array([1, 3, 5, 3, 7, 9, 1, 5, 5])
#● Find all unique elements
#● Find the duplicates (elements that appear more than once)
arr = np.array([1, 3, 5, 3, 7, 9, 1, 5, 5])
unique_elements = np.unique(arr)
counts = np.bincount(arr)
duplicates = np.where(counts > 1)[0] #elements with counts greater than 1
print(unique_elements)
print(counts)
print(duplicates)

[1 3 5 7 9]
[0 2 0 2 0 3 0 1 0 1]
[1 3 5]

In [19]:
#6. Create a 6×6 NumPy array with values from 1 to 36.
#● Extract the middle 4×4 submatrix.
#● Then extract all even numbers from this submatrix.
arr3=np.arange(1,37).reshape(6,6)
sub_matrix=arr3[1:5,1:5]
even_numbers = sub_matrix[sub_matrix %2 == 0]
print(arr3)
print(sub_matrix)
print(even_numbers)

[[ 1  2  3  4  5  6]
 [ 7  8  9 10 11 12]
 [13 14 15 16 17 18]
 [19 20 21 22 23 24]
 [25 26 27 28 29 30]
 [31 32 33 34 35 36]]
[[ 8  9 10 11]
 [14 15 16 17]
 [20 21 22 23]
 [26 27 28 29]]
[ 8 10 14 16 20 22 26 28]

In [24]:
#7. Generate an array of shape (3, 4) with values from 0 to 11.
#● Reshape it to (2, 6)
#● Then flatten it into a 1D array
#● Convert the 1D array back to shape (4, 3).
arr4 = np.arange(12).reshape(3, 4)
reshaped_2x6 = arr4.reshape(2, 6)
flattened = arr4.flatten()
reshaped_4x3 = arr4.reshape(4,3)
print(arr4)
print(reshaped_2x6)
print(flattened)
print(reshaped_4x3)

[[ 0  1  2  3]
 [ 4  5  6  7]
 [ 8  9 10 11]]
[[ 0  1  2  3  4  5]
 [ 6  7  8  9 10 11]]
[ 0  1  2  3  4  5  6  7  8  9 10 11]
[[ 0  1  2]
 [ 3  4  5]
 [ 6  7  8]
 [ 9 10 11]]

In [25]:
#8 . Create an array: a = np.array([[1, 2], [3, 4]])
#● Append a new row [5, 6]
#● Then append a new column [7, 8, 9]
a = np.array([[1, 2], [3, 4]])
a_row = np.vstack([a, [5, 6]])
a_col = np.column_stack([a_row, [7, 8, 9]])
print(a_row)
print(a_col)

[[1 2]
 [3 4]
 [5 6]]
[[1 2 7]
 [3 4 8]
 [5 6 9]]

In [26]:
#9.a = np.array([1, 2, 3])
#b = np.array([4, 5, 6])
#c = np.array([7, 8, 9])
#● Join them into a single array
#● Reshape the result into a 3×3 matrix
#● Extract the diagonal elements
a = np.array([1, 2, 3])
b = np.array([4, 5, 6])
c = np.array([7, 8, 9])
joined = np.concatenate([a, b, c])
matrix = joined.reshape(3, 3)
diagonal_elements = np.diag(matrix)
print(joined)
print(matrix)
print(diagonal_elements)

[1 2 3 4 5 6 7 8 9]
[[1 2 3]
 [4 5 6]
 [7 8 9]]
[1 5 9]

In [30]:
#10. Create a NumPy array of integers from 1 to 20.
#● Extract all values that are divisible by 3 or 5.
#● Count how many such values exist.
arr5 = np.arange(1, 21)
divisible = arr5[(arr5 % 3 == 0) | (arr5 % 5 == 0)]
count_divisible = len(divisible)
print(arr5)
print(divisible)
print(count_divisible)

[ 1  2  3  4  5  6  7  8  9 10 11 12 13 14 15 16 17 18 19 20]
[ 3  5  6  9 10 12 15 18 20]
9

##**pandas activity**

In [36]:
#1. Load the Titanic dataset and display the first 10 rows.
import pandas as pd
import seaborn as sns
data=sns.load_dataset('titanic')
print(data.head(10))

   survived  pclass     sex   age  sibsp  parch     fare embarked   class  \
0         0       3    male  22.0      1      0   7.2500        S   Third
1         1       1  female  38.0      1      0  71.2833        C   First
2         1       3  female  26.0      0      0   7.9250        S   Third
3         1       1  female  35.0      1      0  53.1000        S   First
4         0       3    male  35.0      0      0   8.0500        S   Third
5         0       3    male   NaN      0      0   8.4583        Q   Third
6         0       1    male  54.0      0      0  51.8625        S   First
7         0       3    male   2.0      3      1  21.0750        S   Third
8         1       3  female  27.0      0      2  11.1333        S   Third
9         1       2  female  14.0      1      0  30.0708        C  Second

     who  adult_male deck  embark_town alive  alone
0    man        True  NaN  Southampton    no  False
1  woman       False    C    Cherbourg   yes  False
2  woman       False  NaN  Southampton   yes   True
3  woman       False    C  Southampton   yes  False
4    man        True  NaN  Southampton    no   True
5    man        True  NaN   Queenstown    no   True
6    man        True    E  Southampton    no   True
7  child       False  NaN  Southampton    no  False
8  woman       False  NaN  Southampton   yes  False
9  child       False  NaN    Cherbourg   yes  False

In [37]:
#2. Find the number of missing values in each column.
print(data.isnull().sum())

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

In [38]:
#3. Find the percentage of passengers who survived, grouped by gender
print(data.groupby("sex")["survived"].mean() * 100)

sex
female    74.203822
male      18.890815
Name: survived, dtype: float64

In [39]:
#4. Find the average, median, and standard deviation of passenger ages
print("Average age:", data["age"].mean())
print("Median age:", data["age"].median())
print("Std Dev age:", data["age"].std())

Average age: 29.69911764705882
Median age: 28.0
Std Dev age: 14.526497332334044

In [40]:
#5. Count how many passengers were in each class (pclass).
print(data["pclass"].value_counts())

pclass
3    491
1    216
2    184
Name: count, dtype: int64

In [41]:
#6. Show all passengers who were female, under age 18, and survived.
print(data[(data["sex"] == "female") & (data["age"] < 18) & (data["survived"] == 1)])

     survived  pclass     sex    age  sibsp  parch      fare embarked   class  \
9           1       2  female  14.00      1      0   30.0708        C  Second
10          1       3  female   4.00      1      1   16.7000        S   Third
22          1       3  female  15.00      0      0    8.0292        Q   Third
39          1       3  female  14.00      1      0   11.2417        C   Third
43          1       2  female   3.00      1      2   41.5792        C  Second
58          1       2  female   5.00      1      2   27.7500        S  Second
68          1       3  female  17.00      4      2    7.9250        S   Third
84          1       2  female  17.00      0      0   10.5000        S  Second
156         1       3  female  16.00      0      0    7.7333        Q   Third
172         1       3  female   1.00      1      1   11.1333        S   Third
184         1       3  female   4.00      0      2   22.0250        S   Third
208         1       3  female  16.00      0      0    7.7500        Q   Third
233         1       3  female   5.00      4      2   31.3875        S   Third
237         1       2  female   8.00      0      2   26.2500        S  Second
307         1       1  female  17.00      1      0  108.9000        C   First
329         1       1  female  16.00      0      1   57.9792        C   First
381         1       3  female   1.00      0      2   15.7417        C   Third
389         1       2  female  17.00      0      0   12.0000        C  Second
435         1       1  female  14.00      1      2  120.0000        S   First
446         1       2  female  13.00      0      1   19.5000        S  Second
448         1       3  female   5.00      2      1   19.2583        C   Third
469         1       3  female   0.75      2      1   19.2583        C   Third
479         1       3  female   2.00      0      1   12.2875        S   Third
504         1       1  female  16.00      0      0   86.5000        S   First
530         1       2  female   2.00      1      1   26.0000        S  Second
535         1       2  female   7.00      0      2   26.2500        S  Second
618         1       2  female   4.00      2      1   39.0000        S  Second
644         1       3  female   0.75      2      1   19.2583        C   Third
689         1       1  female  15.00      0      1  211.3375        S   First
691         1       3  female   4.00      0      1   13.4167        C   Third
720         1       2  female   6.00      0      1   33.0000        S  Second
750         1       2  female   4.00      1      1   23.0000        S  Second
777         1       3  female   5.00      0      0   12.4750        S   Third
780         1       3  female  13.00      0      0    7.2292        C   Third
781         1       1  female  17.00      1      0   57.0000        S   First
830         1       3  female  15.00      1      0   14.4542        C   Third
853         1       1  female  16.00      0      1   39.4000        S   First
875         1       3  female  15.00      0      0    7.2250        C   Third

       who  adult_male deck  embark_town alive  alone
9    child       False  NaN    Cherbourg   yes  False
10   child       False    G  Southampton   yes  False
22   child       False  NaN   Queenstown   yes   True
39   child       False  NaN    Cherbourg   yes  False
43   child       False  NaN    Cherbourg   yes  False
58   child       False  NaN  Southampton   yes  False
68   woman       False  NaN  Southampton   yes  False
84   woman       False  NaN  Southampton   yes   True
156  woman       False  NaN   Queenstown   yes   True
172  child       False  NaN  Southampton   yes  False
184  child       False  NaN  Southampton   yes  False
208  woman       False  NaN   Queenstown   yes   True
233  child       False  NaN  Southampton   yes  False
237  child       False  NaN  Southampton   yes  False
307  woman       False    C    Cherbourg   yes  False
329  woman       False    B    Cherbourg   yes  False
381  child       False  NaN    Cherbourg   yes  False
389  woman       False  NaN    Cherbourg   yes   True
435  child       False    B  Southampton   yes  False
446  child       False  NaN  Southampton   yes  False
448  child       False  NaN    Cherbourg   yes  False
469  child       False  NaN    Cherbourg   yes  False
479  child       False  NaN  Southampton   yes  False
504  woman       False    B  Southampton   yes   True
530  child       False  NaN  Southampton   yes  False
535  child       False  NaN  Southampton   yes  False
618  child       False    F  Southampton   yes  False
644  child       False  NaN    Cherbourg   yes  False
689  child       False    B  Southampton   yes  False
691  child       False  NaN    Cherbourg   yes  False
720  child       False  NaN  Southampton   yes  False
750  child       False  NaN  Southampton   yes  False
777  child       False  NaN  Southampton   yes   True
780  child       False  NaN    Cherbourg   yes   True
781  woman       False    B  Southampton   yes  False
830  child       False  NaN    Cherbourg   yes  False
853  woman       False    D  Southampton   yes  False
875  child       False  NaN    Cherbourg   yes   True

In [65]:
#7. Replace missing age values with the median age.
import numpy as np
data["age"] = data["age"].fillna(data["age"].median(),inplace=True)
print(data["age"] )

0      None
1      None
2      None
3      None
4      None
       ...
886    None
887    None
888    None
889    None
890    None
Name: age, Length: 891, dtype: object

/usr/local/lib/python3.12/dist-packages/numpy/lib/_nanfunctions_impl.py:1231: RuntimeWarning: Mean of empty slice
  return np.nanmean(a, axis, out=out, keepdims=keepdims)
/tmp/ipython-input-60902457.py:3: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  data["age"] = data["age"].fillna(data["age"].median(),inplace=True)
/tmp/ipython-input-60902457.py:3: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  data["age"] = data["age"].fillna(data["age"].median(),inplace=True)

In [46]:
# 8. Create age_group column
data["age_group"] = pd.cut(
    data["age"],
    bins=[0, 18, 60, 120],
    labels=["Child", "Adult", "Senior"],
    right=False)
print(data["age_group"])

0      Adult
1      Adult
2      Adult
3      Adult
4      Adult
       ...
886    Adult
887    Adult
888    Adult
889    Adult
890    Adult
Name: age_group, Length: 891, dtype: category
Categories (3, object): ['Child' < 'Adult' < 'Senior']

In [47]:
#d. Use: apply() or np.where() or custom function
data["age_group"] = np.where(data["age"] < 18, "Child",
np.where(data["age"] <= 60, "Adult", "Senior"))
print(data["age_group"])

0      Adult
1      Adult
2      Adult
3      Adult
4      Adult
       ...
886    Adult
887    Adult
888    Adult
889    Adult
890    Adult
Name: age_group, Length: 891, dtype: object

In [48]:
#9. Display the top 5 passengers who paid the highest fare.
print(data.nlargest(5, "fare"))

     survived  pclass     sex   age  sibsp  parch      fare embarked  class  \
258         1       1  female  35.0      0      0  512.3292        C  First
679         1       1    male  36.0      0      1  512.3292        C  First
737         1       1    male  35.0      0      0  512.3292        C  First
27          0       1    male  19.0      3      2  263.0000        S  First
88          1       1  female  23.0      3      2  263.0000        S  First

       who  adult_male deck  embark_town alive  alone age_group
258  woman       False  NaN    Cherbourg   yes   True     Adult
679    man        True    B    Cherbourg   yes  False     Adult
737    man        True    B    Cherbourg   yes   True     Adult
27     man        True    C  Southampton    no  False     Adult
88   woman       False    C  Southampton   yes  False     Adult

In [49]:
# 10. Average fare paid, grouped by both pclass and sex
print(data.groupby(["pclass", "sex"])["fare"].mean())

pclass  sex
1       female    106.125798
        male       67.226127
2       female     21.970121
        male       19.741782
3       female     16.118810
        male       12.661633
Name: fare, dtype: float64

In [50]:
#11. Rename the following columns:
#a. 'sex' → 'gender'
#b. 'fare' → 'ticket_fare'
data.rename(columns={"sex": "gender", "fare": "ticket_fare"}, inplace=True)
print(data.head())

   survived  pclass  gender   age  sibsp  parch  ticket_fare embarked  class  \
0         0       3    male  22.0      1      0       7.2500        S  Third
1         1       1  female  38.0      1      0      71.2833        C  First
2         1       3  female  26.0      0      0       7.9250        S  Third
3         1       1  female  35.0      1      0      53.1000        S  First
4         0       3    male  35.0      0      0       8.0500        S  Third

     who  adult_male deck  embark_town alive  alone age_group
0    man        True  NaN  Southampton    no  False     Adult
1  woman       False    C    Cherbourg   yes  False     Adult
2  woman       False  NaN  Southampton   yes   True     Adult
3  woman       False    C  Southampton   yes  False     Adult
4    man        True  NaN  Southampton    no   True     Adult

In [56]:
# 12. Count passengers survived vs not survived, grouped by class
print(data.groupby("class")["survived"].value_counts())

class   survived
First   1           136
        0            80
Second  0            97
        1            87
Third   0           372
        1           119
Name: count, dtype: int64

/tmp/ipython-input-3051222897.py:2: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  print(data.groupby("class")["survived"].value_counts())

In [53]:
#13. Find the average age of passengers grouped by both class and gender
print(data.groupby(["class", "gender"])["age"].mean())

class   gender
First   female    33.978723
        male      38.995246
Second  female    28.703947
        male      30.512315
Third   female    23.572917
        male      26.911873
Name: age, dtype: float64

/tmp/ipython-input-2343620695.py:2: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  print(data.groupby(["class", "gender"])["age"].mean())